[
    {
      "id": "work1",
      "category": "web-app codeigniter bootstrap",
      "image": "images/v29_68.png",
      "media": [
        {"type": "image", "src": "images/v29_68.png"},
        {"type": "video", "src": "videos/30 second timer.mp4"}
      ],
      "modalTitle": "Hospital Finder Platform",
      "modalName": "MediTect",
      "modalDate": "May 2021—July 2021",
      "overview": "MediTect is an easy-to-use website helping users find nearby hospitals and manage their health accounts effortlessly. This is a solution developed to address the needs of Filipinos and healthcare workers during the height of the pandemic.",
      "features": ["Easily find nearby hospitals based on your location.", "Quickly access information about hospital services and contact numbers.", "Allow users to personalize their profiles with relevant health information and preferences.", "Protect user data during the sign-up process with encryption."],
      "tech": "Git, HTML5, CSS3, JavaScript, Bootstrap, CodeIgniter, PHP, MySQL, Heroku, Trello",
      "process": "Performed front-end development, developed technical documentation, and conducted market research. Actively engaged in Agile Scrum meetings for efficient sprint planning and progress tracking. Assisted in managing project tasks with Trello and produced engaging creative materials, including PowerPoint presentations and animated videos, for impactful project pitches.",
      "results": "Featured on the Asia Pacific College website, this project was recognized as one of the best bootcamp projects among the Senior High School cohort of 2020-2021.",
      "liveSite": "https://meditect.herokuapp.com/",      
      "Article2": "https://apc.edu.ph/programs/senior-high-school/"
    },
    {
      "id": "work2",
      "category": "web-app bootstrap",
      "image": "images/v29_69.png",
      "modalTitle": "Company Website",
      "modalName": "Retail Motorcycle Parts & Service",
      "modalDate": "April 2022",
      "overview": "A website highlighting the products and services of a micro-small retailer specializing in motorcycle maintenance, repair, and related parts and accessories.",
      "features": ["Provides an overview of the company's history, mission, and contact details.", "Displays a detailed list of products with descriptions, images, and purchasing options.", "Offers a collection of informative articles or blog posts related to the company’s products or industry."],
      "tech": "HTML5, CSS3, JavaScript, Bootstrap, 000webhost, Trello",
      "process": "Managed the entire website development lifecycle, from requirements gathering and documentation to front-end development.",
      "results": "Received the highest grade in the IT130L-AM1 class, well-received by the company.",
      "liveSite": "https://ynmotors.000webhostapp.com/"
    },
    {
      "id": "work3",
      "category": "desktop java",
      "image": "images/v29_70.png",
      "modalTitle": "Condo Unit Rental, Sales, and Management System",
      "modalName": "Real Estate",
      "modalDate": "November 2022",
      "overview": "A Java GUI application designed to specify condo details, manage unit sales or leases, and generate comprehensive reports detailing the status of various condominiums.",
      "features": ["Detailed condo listings with descriptions and pricing, allows admin to update and track property details.", "Tenants can access lease information and make rent payments.", "Shows the number of available units."],
      "tech": "Java",
      "process": "Solely  designed and developed using Java Swing libraries and object-oriented programming principles.",
      "results": "The application efficiently managed condo listings."
    },
    {
      "id": "work4",
      "category": "web-app bootstrap",
      "image": "images/v29_71.png",
      "modalName": "CardinalOrg",
      "modalDate": "October 2022",
      "modalTitle": "Student Organization Management System",
      "overview": "CardinalOrg is a website offering school organization listings, member registration, and administrative tools for event applications.",
      "features": ["Comprehensive listings of school organizations, member registration, and profile management.", "Tools for applying, managing, and tracking events, along with a calendar view for upcoming activities.", "An administrative dashboard for overseeing registrations, event applications, and generating reports and analytics."],
      "tech": "HTML5, CSS3, JavaScript, Bootstrap, 000webhost, Figma",
      "process": "Managed the entire website development lifecycle, from requirements gathering to documentation. Solely developed the prototype and translated it into a functional website.",
      "results": "Developed a Proof of Concept."
    },
    {
      "id": "work5",
      "category": "ui-ux",
      "image": "images/v29_72.png",
      "modalTitle": "Salon Services Appointment System",
      "modalName": "Nail Salon",
      "modalDate": "February 2023",
      "overview": "A website interface designed via Figma, presenting company information, client testimonials, service catalogs, and a streamlined booking system for salon appointments.",
      "features": ["Clients can browse and select from a variety of salon services, including haircuts, coloring, styling, nails, and more.", "Allows clients to book, reschedule, or cancel appointments online anytime.", "Provides salon staff with an easy-to-use interface for managing schedules and appointments."],
      "tech": "Figma",
      "process": "Solely determined user requirements and designed using Figma for UI/UX.",
      "results": "Well-received by the client.",
      "figma": "https://www.figma.com/proto/X9bWjSeMJiLTdbz7Q415Pa/Nailssoposh-Booking-Website?node-id=0-3&starting-point-node-id=0%3A3&scaling=scale-down-width&content-scaling=fixed&t=XmnOWdXi70Ko47qD-1"
    },
    {
      "id": "work6",
      "category": "web-app bootstrap",
      "image": "images/v29_73.png",
      "modalTitle": "Event Booking System",
      "modalName": "Church",
      "modalDate": "February 2023",
      "features": ["Shows upcoming church events, services, meetings, and activities in a user-friendly calendar view.", "Allows members and guests to register for church events, services, seminars, or special programs online.", "Manage guest lists, check-ins, and attendee information for events and services."],
      "overview": "A website enabling seamless event bookings within a church environment. It simplifies event browsing and reservations for congregants.",
      "tech": "HTML5, CSS3, JavaScript, Bootstrap, PHP, MySQL, 000webhost, Figma",
      "process": "Analyzed user requirements and independently developed a hosted solution, managing the entire process from planning to deployment to ensure it met user needs and enhanced overall functionality.",
      "results": "Well-received by the client.",
       "figma": ""
    },
    {
      "id": "work7",
      "category": "desktop java",
      "image": "images/v29_74.png",
      "modalTitle": "Clicking Game",
      "modalName": "Clickers",
      "modalDate": "April 2023",
      "overview": "Clickers is a game presenting a timed clicking challenge with options for static clicking and navigating a moving object.",
      "features": ["Objects that users click to score points.","Displays the current score on the screen.","Includes a countdown and stopwatch to track gameplay duration.","Multiple stages or levels with increasing difficulty."],
      "tech": "Java",
      "process": "Solely designed and developed the Java-based application with mouse, menu, and timer events.",
      "results": "Fully functional interactive game."
    },
    {
      "id": "work8",
      "category": "ui-ux",
      "image": "images/v29_75.png",
      "modalTitle": "Health Companion Mobile Application",
      "modalName": "SafeSteps",
      "modalDate": "June 2023",
      "overview": "SafeSteps is a mobile app interface designed via Figma, facilitating users in finding nearby testing clinics and receiving diagnoses.",
      "features":["A comprehensive STD testing facility locator with filtering options and detailed information.", "Secure and confidential sexual health consultations with expert professionals", "A community forum empowering women’s sexual health, providing a safe, anonymous, and accountable space for discussions."],
      "tech": "Figma, Notion",
      "process": "Led the UI/UX team in developing intuitive, user-friendly interfaces, while also guiding the definition of app objectives, stakeholder engagement, and user research. Pitched the app to a panel of stakeholders.",
      "results": "Awarded the top prize at the Tech4Women Singapore Hackathon for innovative solutions in women's technology. Got featured in several platforms including PhilStar.",
      "Article1": "https://www.mapua.edu.ph/news/21st-century-innovators-to-watch-out-for-meet-young-mapuans-who-will-change-the-world",
      "Article3": "https://www.facebook.com/philstarnews/videos/770488578486843/"
    },
    {
      "id": "work9",
      "category": "web-app bootstrap",
      "image": "images/v29_76.png",
      "modalTitle": "Zoo Management System",
      "modalName": "Animal Park",
      "modalDate": "August 2023",
      "overview": "A website designed to manage animal and staff directories efficiently.",
      "features":["Comprehensive animal records, including health, diet, and habitat details.", "Visitor management system for ticketing, feedback, and event scheduling.","Staff management, including roles, schedules, and communication tools."],
      "tech": "HTML5, CSS3, JavaScript, Bootstrap, PHP, MySQL, Notion",
      "process": "Identified user requirements based on a case study and independently developed the website, managing the entire process from planning to deployment to ensure it met user needs and enhanced overall functionality.",
      "results": "Fully functional website."
    },
    {
      "id": "work10",
      "category": "web-app",
      "image": "images/10.png",
      "modalTitle": "AI-Powered Plant Disease Detection Platform",
      "modalName": "GrowTogether",
      "modalDate": "October 2023",
      "overview": "GrowTogether is a website allowing users to track plant disease trends and analyze plant photos.",
      "features":["Utilizes machine learning algorithms to analyze plant photos for accurate disease identification, including apple scabs, by training models on extensive datasets.", "Visualizes plant disease trends on an interactive map, leveraging machine learning to predict disease spread and identify patterns based on historical and current data.", "Offers tailored advice and preventive measures for managing plant diseases."],
      "tech": "HTML5, CSS3, Python, Figma, Notion",
      "process": "Led the development of the solution and its user interface/user experience (UI/UX), independently translating a wireframe into a fully functional front-end website for plant disease detection.",
      "results": "Submitted as an entry for 2023 SATU SMART 5th International Innovation competition.",
      "figma": ""
    },
    {
      "id": "work11",
      "category": "ui-ux",
      "image": "images/11.png",
      "modalTitle": "Professional Social Networking Platform",
      "modalName": "Circunect",
      "modalDate": "April 2023",
      "overview": "Circunect is a web app interface connecting educational institutions and industries.",
      "features":["Enables users to find and manage talent and partnerships efficiently, facilitating connections and collaboration with potential collaborators and organizations.", "Provides tools for scheduling, tracking, and managing events and tasks, streamlining organization and execution for better efficiency.", "Offers an interconnected network for accessing resources, networking opportunities, and cost-effective solutions, supporting both operational needs and sustainability initiatives."],
      "tech": "Figma, Notion",
      "process": "Developed the prototype using Figma and created the required presentation materials for the pitch.",
      "results": "Submitted as an entry for 2023 ASEAN-China-India Youth Leadership Summit competition.",
      "figma": "https://www.figma.com/proto/Yk63LXJtdrHzanVXkDaz9K/Circunect?node-id=14-115&node-type=CANVAS&t=tty9bpz53AdsRMjL-1&scaling=scale-down-width&content-scaling=fixed&page-id=0%3A1&starting-point-node-id=14%3A116"
    },
    {
      "id": "work12",
      "category": "ui-ux",
      "image": "images/12.png",
      "modalTitle": "Audit Management System",
      "modalName": "Audit.Edu",
      "modalDate": "December 2023",
      "overview": "Audit.Edu is a web app interface for internal audits in higher educational institutions.",
      "features":["Tools for planning, scheduling, and managing audit activities and resources in alignment with ISO 21001 standards.","Identifies, assesses, and mitigates risks associated with audit processes, including risk assessment tools and action plans.","System for logging, tracking, and managing complaints or issues identified during audits, with tools for resolution and follow-up.", "Centralized repository for storing, organizing, and versioning audit-related documents, including policies, procedures, and reports."]
      ,"tech": "Figma, Notion",
      "process": "Gathered user requirements through consultations with education audit officers, spearheaded the UI/UX development, and created comprehensive presentation materials and developed financial projections and business models to support startup growth.",
      "results": "The system was highlighted in one of the papers presented at the 8th International Conference on Business and Information Management, held from August 16-18, 2024, in Pattaya, Thailand.",
      "figma": "https://www.figma.com/proto/NgyWRdeR2Q1QOIK2hz1PHW/E-Audit-Pro?node-id=18-2&starting-point-node-id=18%3A2&scaling=scale-down-width&content-scaling=fixed&t=UozwK46Cs9uAKaoo-1",      
      "behance": "https://www.behance.net/gallery/191125397/Audit-Management-System"
    },
    {
      "id": "work13",
      "category": "web-app codeigniter bootstrap",
      "image": "images/v29_77.png",
      "modalTitle": "Transaction Processing System",
      "modalDate": "March 2024—June 2024",
      "modalName": "ProVisionSupply",
      "overview": "ProvisionSupply is a website for construction supply stores, including advanced modules for order processing and detailed reporting.",
      "features": ["Includes functionalities for quotation generation, point of sale (POS), and order status tracking, allowing for efficient processing of orders, generating sales orders and quotes, and managing reservations.", "rovides a dashboard to view overall sales, total orders, and forecasts inventory, along with detailed reports on sales, inventory, and reservation transactions.", "Manages customer profiles and product information, including account creation, profile updates, product selection, reservation, and real-time inventory tracking."],
      "tech": "HTML5, CSS3, JavaScript, Bootstrap, 000webhost, JQuery, Hostinger, Notion",
      "process": "Led the entire development process by managing project timelines, designing and implementing core system functionalities, and ensuring seamless integration of modules. Collaborated with stakeholders to refine requirements and maintained comprehensive documentation for ongoing support and enhancements.",
      "results": "The system was highlighted in one of the papers presented at the 6th World Symposium on Software Engineering, held from September 13-15, 2024, in Kyoto, Japan.",
      "liveSite": "https://provisionsupply.site/"
    },
    {
      "id": "work14",
      "category": "low-code appsheet",
      "image": "images/v29_78.png",
      "modalTitle": "Risk Tracker Application",
      "modalName": "RiskRadar",
      "modalDate": "July 2024",
      "overview": "RiskRadar is a website for managing organizational risk data.",
      "features":["Aggregate and centralize relevant risk data and organizational information for a comprehensive view of all risks and team progress.", "Analyze risk trends and continuously monitor the current status of risks to identify and address potential issues proactively.", "Receive real-time alerts and notifications to stay informed about critical changes and updates in risk status."],
      "tech": "AppSheet",
      "process": "Gathered and analyzed requirements, designed and developed the system using Rapid Application Development (RAD) techniques, and implemented features based on user feedback. Conducted thorough testing, deployed the solution, and created documentation and support materials to ensure successful launch and ongoing maintenance.",
      "results": "Presented the live project to Globe's Governance, Risk and, Compliance Team. Project was commended by the Vice President."
    },
    {
      "id": "work15",
      "category": "web-app laravel",
      "image": "images/v29_79.png",
      "modalTitle": "Announcement System",
      "modalName": "EGOVSMS",
      "modalDate": "July 2024",
      "overview": "EGOVSMS is a website for government communication via SMS.",
      "features":["Provides an overview of events, processes, and the status of schedules.", "Lists available templates for scheduled messages, making it easier to manage and use pre-designed message formats.", "Offers details on both recurrent and one-time messaging, including management and information related to each type of schedule."],
      "tech": "HTML5, CSS3, Bootstrap, Laravel",
      "process": "Developed the website's front-end, while also crafting documentation to support its development and usability.",
      "results": "The project is under consideration for inclusion in the 7th International Conference on Computational Intelligence and Intelligent Systems, scheduled to take place in Nagoya, Japan, from November 22-24, 2024."
      
    }
  ]
  